tiborsimon/embedded-tdd-headers/pic/pic18/pic18f25k20_tdd.h
#define GCEN                          522
#define SSPCON1                       523
#define SSPM0                         524
#define SSPM                          525
#define SSPM1                         526
#define SSPM2                         527
#define SSPM3                         528
#define CKP                           529
#define SSPEN                         530
#define SSPOV                         531
#define WCOL                          532
#define SSPSTAT                       533
#define BF                            534
#define UA                            535
#define R_NOT_W                       536
#define NOT_W                         537
#define nW                            538
#define RW                            539
#define nWRITE                        540
#define R                             541
#define W                             542
#define NOT_WRITE                     543
#define R_nW                          544
#define R_W                           545
#define START                         546
#define S                             547
#define STOP                          548
#define P                             549
#define A                             550
#define NOT_A                         551
#define nA                            552
#define D_A                           553
#define D_nA                          554
#define D                             555
#define DA                            556
#define D_NOT_A                       557
#define NOT_ADDRESS                   558
#define nADDRESS                      559
#define CKE                           560
#define SMP                           561
#define T2CON                         562
#define T2CKPS0                       563
#define T2CKPS                        564
#define T2CKPS1                       565
#define TMR2ON                        566
#define T2OUTPS0                      567
#define T2OUTPS                       568
#define T2OUTPS1                      569
#define T2OUTPS2                      570
#define T2OUTPS3                      571
#define PR2                           572
#define WM0                           573
#define WM1                           574
#define WAIT0                         575
#define WAIT1                         576
#define EBDIS                         577
#define T1CON                         578
#define TMR1ON                        579
#define TMR1CS                        580
#define NOT_T1SYNC                    581
#define T1SYNC                        582
#define nT1SYNC                       583
#define T1OSCEN                       584
#define SOSCEN                        585
#define T1CKPS0                       586
#define T1CKPS                        587
#define T1CKPS1                       588
#define T1RUN                         589
#define T1CON_RD16                    590
#define T1RD16                        591
#define RCON                          592
#define BOR                           593
#define NOT_BOR                       594
#define nBOR                          595
#define POR                           596
#define nPOR                          597
#define NOT_POR                       598
#define PD                            599
#define nPD                           600
#define NOT_PD                        601
#define NOT_TO                        602
#define nTO                           603
#define TO                            604
#define nRI                           605
#define NOT_RI                        606
#define RI                            607
#define SBOREN                        608
#define IPEN                          609
#define WDTCON                        610
#define SWDTE                         611
#define SWDTEN                        612
#define HLVDCON                       613
#define HLVDL                         614
#define HLVDL0                        615
#define LVV0                          616
#define LVDL0                         617
#define HLVDL1                        618
#define LVDL1                         619
#define LVV1                          620
#define HLVDL2                        621
#define LVV2                          622
#define LVDL2                         623
#define HLVDL3                        624
#define LVV3                          625
#define LVDL3                         626
#define HLVDEN                        627
#define LVDEN                         628
#define BGST                          629
#define IRVST                         630
#define IVRST                         631
#define VDIRMAG                       632
#define OSCCON                        633
#define SCS0                          634
#define SCS                           635
#define SCS1                          636
#define IOFS                          637
#define OSTS                          638
#define IRCF                          639
#define IRCF0                         640
#define IRCF1                         641
#define IRCF2                         642
#define IDLEN                         643
#define T0CON                         644
#define T0PS                          645
#define T0PS0                         646
#define T0PS1                         647
#define T0PS2                         648
#define PSA                           649
#define T0SE                          650
#define T0CS                          651
#define T08BIT                        652
#define TMR0ON                        653
#define STATUS                        654
#define C                             655
#define CARRY                         656
#define DC                            657
#define ZERO                          658
#define Z                             659
#define OV                            660
#define OVERFLOW                      661
#define N                             662
#define NEGATIVE                      663
#define INTCON3                       664
#define INT1IF                        665
#define INT1F                         666
#define INT2IF                        667
#define INT2F                         668
#define INT1E                         669
#define INT1IE                        670
#define INT2IE                        671
#define INT2E                         672
#define INT1P                         673
#define INT1IP                        674
#define INT2IP                        675
#define INT2P                         676
#define INTCON2                       677
#define RBIP                          678
#define TMR0IP                        679
#define INTEDG2                       680
#define INTEDG1                       681
#define INTEDG0                       682
#define RBPU                          683
#define NOT_RBPU                      684
#define nRBPU                         685
#define INTCON                        686
#define RBIF                          687
#define INT0F                         688
#define INT0IF                        689
#define T0IF                          690
#define TMR0IF                        691
#define RBIE                          692
#define INT0E                         693
#define INT0IE                        694
#define T0IE                          695
#define TMR0IE                        696
#define PEIE                          697
#define PEIE_GIEL                     698
#define GIEL                          699
#define GIE_GIEH                      700
#define GIE                           701
#define GIEH                          702
#define SP0                           703
#define STKPTR                        704
#define SP1                           705
#define SP2                           706
#define SP3                           707
#define SP4                           708
#define STKUNF                        709
#define STKOVF                        710
#define STKFUL                        711

#endif // _PIC18F25K20_H_
